In [11]:
import pandas as pd

In [13]:
# 1.1 Creating a Series for Product Prices
prices = pd.Series([250, 500, 750, 1000, 1250])
display(prices)

0     250
1     500
2     750
3    1000
4    1250
dtype: int64

In [15]:
# 1.2 Assign product names as the index
prices.index = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
display(prices)

Product A     250
Product B     500
Product C     750
Product D    1000
Product E    1250
dtype: int64

In [17]:
# 1.3 Access the price of Product C
prices['Product C']

750

In [19]:
# 2.1 Sort the Series by product names (index) in alphabetical order
prices.sort_index()

Product A     250
Product B     500
Product C     750
Product D    1000
Product E    1250
dtype: int64

In [21]:
# 2.2 Sort the Series by product prices in descending order
prices.sort_values(ascending=False)

Product E    1250
Product D    1000
Product C     750
Product B     500
Product A     250
dtype: int64

In [23]:
# 2.3 Use describe() to get a quick statistical summary of the product prices
prices.describe()

count       5.000000
mean      750.000000
std       395.284708
min       250.000000
25%       500.000000
50%       750.000000
75%      1000.000000
max      1250.000000
dtype: float64

In [25]:
# 3.1 Create a Series with a list of items in stock
items = pd.Series(['Laptop', 1200, 'Tablet', 800, 'Monitor', 300])
items

0     Laptop
1       1200
2     Tablet
3        800
4    Monitor
5        300
dtype: object

In [27]:
# 4.1 Create a DataFrame for customer orders
data = {'Customer': ['Alice', 'Bob', 'Charlie'], 'Order Amount': [200, 450, 300], 'Location': ['NY', 'LA', 'Chicago']}
orders = pd.DataFrame(data)
display(orders)

  Customer  Order Amount Location
0    Alice           200       NY
1      Bob           450       LA
2  Charlie           300  Chicago

In [29]:
# 4.2 Display the DataFrame
display(orders)

  Customer  Order Amount Location
0    Alice           200       NY
1      Bob           450       LA
2  Charlie           300  Chicago

In [32]:
# 5.1 Reset the index of the DataFrame
orders_reset = orders.reset_index(drop=True)
display(orders_reset)

  Customer  Order Amount Location
0    Alice           200       NY
1      Bob           450       LA
2  Charlie           300  Chicago

In [36]:
# 5.2 Set the Customer column as the index of the DataFrame
orders_indexed = orders.set_index('Customer')
display(orders_indexed)

          Order Amount Location
Customer
Alice              200       NY
Bob                450       LA
Charlie            300  Chicago

In [41]:
# 5.3 Reset the index back to the default
orders_reset_again = orders_indexed.reset_index()
display(orders_reset_again)

  Customer  Order Amount Location
0    Alice           200       NY
1      Bob           450       LA
2  Charlie           300  Chicago

In [45]:
# 6.1 Sort the DataFrame by the Order Amount in ascending order
orders.sort_values(by='Order Amount')

  Customer  Order Amount Location
0    Alice           200       NY
2  Charlie           300  Chicago
1      Bob           450       LA

In [49]:
# 6.2 Sort the DataFrame by the Location column in alphabetical order
orders.sort_values(by='Location')

  Customer  Order Amount Location
2  Charlie           300  Chicago
1      Bob           450       LA
0    Alice           200       NY

In [55]:
# 6.3 Use describe() to obtain a summary of the Order Amounts
orders['Order Amount'].describe()

count      3.000000
mean     316.666667
std      125.830574
min      200.000000
25%      250.000000
50%      300.000000
75%      375.000000
max      450.000000
Name: Order Amount, dtype: float64

In [57]:
# 7.1 Filter orders with amount greater than 300
high_value_orders = orders[orders['Order Amount'] > 300]
high_value_orders

  Customer  Order Amount Location
1      Bob           450       LA

In [60]:
# 7.2 Filter orders placed by customers in NY
ny_orders = orders[orders['Location'] == 'NY']
ny_orders

  Customer  Order Amount Location
0    Alice           200       NY